@ocofaigh 
```
Should be false
        	Test:       	TestRunUpgradeExample
        	Messages:   	Resource(s) identified to be destroyed 
        	            	Name: service_credentials_secret
        	            	Address: module.secret_manager_service_credential.ibm_sm_service_credentials_secret.service_credentials_secret[0]
        	            	Actions: [delete create]
```
```
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:   # module.secret_manager_service_credential.ibm_sm_service_credentials_secret.service_credentials_secret[0] must be replaced
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: -/+ resource "ibm_sm_service_credentials_secret" "service_credentials_secret" {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ created_at              = "2024-10-01T14:18:48Z" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ created_by              = "IBMid-666000KAO3" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ credentials             = (sensitive value)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ crn                     = "crn:v1:bluemix:public:secrets-manager:us-south:a/abac0df06b644a9cabc6e44f55b3880e:79c6d411-c18f-4670-b009-b0044a238667:secret:8663a154-c35c-f741-939f-5a0e550e9ef8" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ custom_metadata         = {} -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ downloaded              = true -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ expiration_date         = "2024-12-30T14:18:50Z" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ id                      = "us-south/79c6d411-c18f-4670-b009-b0044a238667/8663a154-c35c-f741-939f-5a0e550e9ef8" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ locks_total             = 0 -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:         name                    = "sm-secret-module-upg-wdje4u-service-credentials"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ next_rotation_date      = "2024-12-29T14:18:48Z" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ secret_id               = "8663a154-c35c-f741-939f-5a0e550e9ef8" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ secret_type             = "service_credentials" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ state                   = 1 -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ state_description       = "active" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ updated_at              = "2024-10-01T14:18:50Z" -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       - version_custom_metadata = {} -> null
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ versions_total          = 1 -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:         # (7 unchanged attributes hidden)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: 
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:       ~ source_service {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:           ~ iam          = [
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:               - {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                   - apikey    = [
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                       - {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                           - description = "Auto-generated for key crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ab759ee7-3f9f-4a6a-af04-943d76026509:resource-key:c25b4c0f-c1e3-41ba-aa07-1d58521cf554"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                           - name        = "sm-secret-module-upg-wdje4u-service-credentials"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                         },
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                     ]
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                   - role      = [
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                       - {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                           - crn = "crn:v1:bluemix:public:iam::::serviceRole:Writer"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                         },
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                     ]
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                   - serviceid = [
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                       - {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                           - crn = "crn:v1:bluemix:public:iam-identity::a/abac0df06b644a9cabc6e44f55b3880e::serviceid:ServiceId-1e8a0df6-bebd-4e0a-8524-c00c3c631323"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                         },
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                     ]
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                 },
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:             ] -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:           ~ parameters   = { # forces replacement
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:               + "HMAC" = "false"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:             }
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:           ~ resource_key = [
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:               - {
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                   - crn  = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ab759ee7-3f9f-4a6a-af04-943d76026509:resource-key:c25b4c0f-c1e3-41ba-aa07-1d58521cf554"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                   - name = "sm-secret-module-upg-wdje4u-service-credentials"
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:                 },
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:             ] -> (known after apply)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: 
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:             # (2 unchanged blocks hidden)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:         }
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: 
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:         # (1 unchanged block hidden)
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185:     }
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: 
TestRunUpgradeExample 2024-10-01T14:19:19Z command.go:185: Plan: 1 to add, 0 to change, 1 to destroy.
```